<!doctype html>
<title>Sara & Adam's Wedding</title>
<link rel="stylesheet" href="style.css">
<nav>
  <h1>Sara & Adam's Wedding</h1>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/accommodation.html">Accommodation / Boende</a></li>
    <li><a href="/program.html">Information & Program</a></li>
    <li><a href="https://docs.google.com/forms/d/e/1FAIpQLSemHvLciOSASNpD5jI5Pmb9nesqD7XWk6F5NaecHNM4MV94Pg/viewform?usp=header" target="_blank" rel="noopener noreferrer">RSVP / OSA</a></li>
  </ul>
</nav>

<h1>Information</h1>

<h2>Speeches</h2>

Swedish Wedding Speeches - What's All This Then?
If you're Irish, you might be expecting a few speeches at the end of the meal-the best man, maybe the father of the bride, a few heartfelt words and a toast or two.

But this is also a Swedish wedding... and here, speeches are a whole thing.

At Swedish weddings, speeches happen throughout the meal, not just at the end. Friends, family, distant relatives, even co-workers might get up and say a few words. Some will be funny, some touching, some musical-you never quite know what's coming. And that's part of the fun!

Here's what to expect:

<ul>
    <li>They're spread out: Speeches are spaced between courses, so the meal keeps flowing.</li>

    <li>Anyone can speak (who signs up in advance): There's usually a speech coordinator, so things don't get out of hand.</li>

    <li>They're personal: Expect stories, songs, props, and maybe the occasional tear.</li>

    <li>You can join in! If you're inspired to say a few words, ask the toastmaster-it's not too late.</li>
</ul>

So sit back, enjoy the show, and get ready for some very Swedish-style storytelling. Sl&#225;inte and sk&#229;l!

<p>Do you want to hold a speech? Contact our toastmasters Kristin &#214;ster and Kevin Lynch at <a href="mailto:adamandsara2025@gmail.com">adamandsara2025@gmail.com</a></p>

<h2>Tal</h2>

<p>Vill du h&#229;lla ett tal? Kontakta v&#229;ra toastmasters Kristin &#214;ster och Kevin Lynch p&#229; <a href="mailto:adamandsara2025@gmail.com">adamandsara2025@gmail.com</a></p>

<h2>Breakfast, lunch and dinner</h2>

<p>If you choose to arrive at the Friday, you are invited to have pizza with us at Rock Farm!</p>

<p>Breakfast can be bought when booking the accommodation.
There is also the possibility to make your own breakfast in the kitchens at the Rock Farm area,
if you bring ingredients.
We will also put some ingredients there for a basic breakfast.</p>

<p>Lunch can be bought in the village of Slane, or you can prepare your own lunch in the
kitchens at the area, if you bring ingredients.</p>

<h2>Frukost, lunch och middag</h2>
<p>Om du anl&#228;nder p&#229; fredagen &#228;r du varmt v&#228;lkommen att delta i en pizzamiddag p&#229; Rock Farm!</p>

<p>Frukost kan k&#246;pas n&#228;r man bokar boende. Det finns ocks&#229; m&#246;jlighet att g&#246;ra sin egen frukost
i k&#246;ken p&#229; omr&#229;det p&#229; Rock Farm, om man tar med egna ingredienser.
Vi kommer ocks&#229; att st&#228;lla dit n&#229;gra basala ingredienser.</p>

<p>Lunch kan k&#246;pas i byn Slane, eller s&#229; kan man laga egen lunch i k&#246;ken p&#229; omr&#229;det om man tar
med ingredienser.</p>

<h1>Premilinary program / Prelimin&#228;rt program</h1>

<h2>Friday 22 August</h2>

<p>15.00 Check in to the accommodations</p>
<p>18.30 Pizza dinner at Rock Farm</p>

<h2>Saturday 23 August</h2>

<p>15.00 Ceremony starts</p>
<p>18.30 Dinner starts</p>
<p>22.00 Party starts</p>

<h2>Sunday 24 August</h2>

<p>11.00 Check out from accommodations areas</p>
